<h2 align="center"> Pandas Vs Pyspark </h2>

Resources : <br>
https://sparkbyexamples.com/<br>
https://github.com/srivatsan88/

If Java not installed Install JAVA too and Set the required environment variable<br>
Link : https://www.youtube.com/watch?v=XvbEADU0IPU&t=729s&ab_channel=TheAIUniversity

#### Loading & Reading Data

In [1]:
import pandas as pd 
import numpy as np

In [2]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *

spark=SparkSession.builder.appName("Pyspark_EDA").getOrCreate()

In [3]:
spark

In [90]:
# Reading the .csv file in Pandas

df_pandas=pd.read_csv("Data/Titanic.csv")
df_pandas.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S

In [91]:
# File location and type

# If inferSchema is false then all the datatypes are considered to be of string datatypes by default.

df_pyspark=spark.read.option('header','true').csv("Data/Titanic.csv",inferSchema=True)
df_pyspark.show(3)

+-----------+--------+------+----------------+----+----+-----+-----+---------+-----+------+--------+
|PassengerId|Survived|Pclass|            Name| Sex| Age|SibSp|Parch|   Ticket| Fare| Cabin|Embarked|
+-----------+--------+------+----------------+----+----+-----+-----+---------+-----+------+--------+
|          0|       1|     1|Oconnor, Frankie|male|null|    2|    0|   209245|27.14|C12239|       S|
|          1|       0|     3|     Bryan, Drew|male|null|    0|    0|    27323|13.35|  null|       S|
|          2|       0|     3|  Owens, Kenneth|male|0.33|    1|    2|CA 457703|71.29|  null|       S|
+-----------+--------+------+----------------+----+----+-----+-----+---------+-----+------+--------+
only showing top 3 rows

In [6]:
df_pyspark.first()         # Returns the first Row

Row(PassengerId=0, Survived=1, Pclass=1, Name='Oconnor, Frankie', Sex='male', Age=None, SibSp=2, Parch=0, Ticket='209245', Fare=27.14, Cabin='C12239', Embarked='S')

In [7]:
df_pyspark.take(3)         # Returns a list of first 3 Rows

[Row(PassengerId=0, Survived=1, Pclass=1, Name='Oconnor, Frankie', Sex='male', Age=None, SibSp=2, Parch=0, Ticket='209245', Fare=27.14, Cabin='C12239', Embarked='S'),
 Row(PassengerId=1, Survived=0, Pclass=3, Name='Bryan, Drew', Sex='male', Age=None, SibSp=0, Parch=0, Ticket='27323', Fare=13.35, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=0, Pclass=3, Name='Owens, Kenneth', Sex='male', Age=0.33, SibSp=1, Parch=2, Ticket='CA 457703', Fare=71.29, Cabin=None, Embarked='S')]

#### Dataframe Information

In [8]:
# Type 
print("Pandas DataFrame Type :",type(df_pandas))
print("Pyspark DataFrame Type", type(df_pyspark))

Pandas DataFrame Type : <class 'pandas.core.frame.DataFrame'>
Pyspark DataFrame Type <class 'pyspark.sql.dataframe.DataFrame'>

In [9]:
# Size
print("Size of the Pandas dataframe (Rows*Columns) : ",df_pandas.size)
print("Size of the Pyspark dataframe (Rows*Columns) : ",(df_pyspark.count()*len(df_pyspark.columns)))

Size of the Pandas dataframe (Rows*Columns) :  1200000
Size of the Pyspark dataframe (Rows*Columns) :  1200000

In [10]:
# Memory usage
print("Total memory Usage of the Pandas Dataframe :",df_pandas.memory_usage().sum())
print("Total memory Usage of the Pyspark Dataframe :",df_pyspark.toPandas().memory_usage().sum())

Total memory Usage of the Pandas Dataframe : 9600128
Total memory Usage of the Pyspark Dataframe : 7600128

#### Dataframe Shape information

In [11]:
# For number of rows
print("Number of Rows :\n")
print(df_pandas.shape[0])         # Pandas
print(df_pyspark.count())         # Pyspark

# For number of columns
print("Number of Columns :\n")
print(df_pandas.shape[1])        # Pandas
print(len(df_pyspark.columns))   # Pyspark

Number of Rows :

100000
100000
Number of Columns :

12
12

#### Dataframe Column Information

In [12]:
print(df_pandas.columns)            # Pandas
print(df_pyspark.columns)           # Pyspark

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [13]:
print(type(df_pandas.columns))
print(type(df_pyspark.columns))

<class 'pandas.core.indexes.base.Index'>
<class 'list'>

#### Checking datatypes

In [14]:
df_pandas.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [15]:
df_pyspark.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [16]:
df_pandas.Age.dtype

dtype('float64')

In [17]:
df_pyspark.select('Age').dtypes  # Pyspark has no attribute called dtype like pandas
#Alternate code : df_pyspark.select(df_pyspark['Age']).dtypes

[('Age', 'double')]

In [18]:
# Checking datatypes of more than 1 column in Pandas

df_pandas[['Age','Survived']].dtypes

Age         float64
Survived      int64
dtype: object

In [19]:
# Checking datatypes of more than 1 column in Pyspark

df_pyspark.select('Age','Survived').dtypes

[('Age', 'double'), ('Survived', 'int')]

#### Datatype Conversion

In [20]:
# Converting PassengerId to Object datatype
df_pandas.PassengerId=df_pandas.PassengerId.astype('str')
df_pandas.PassengerId.dtype

dtype('O')

In [21]:
from pyspark.sql.types import StringType

df_pyspark.select(df_pyspark['PassengerId'].cast(StringType())).dtypes

[('PassengerId', 'string')]

#### Schema Information

In [22]:
df_pandas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   PassengerId  100000 non-null  object
 1   Survived     100000 non-null  int64
 2   Pclass       100000 non-null  int64
 3   Name         100000 non-null  object
 4   Sex          100000 non-null  object
 5   Age          96708 non-null   float64
 6   SibSp        100000 non-null  int64
 7   Parch        100000 non-null  int64
 8   Ticket       95377 non-null   object
 9   Fare         99866 non-null   float64
 10  Cabin        32134 non-null   object
 11  Embarked     99750 non-null   object
dtypes: float64(2), int64(4), object(6)
memory usage: 9.2+ MB

In [23]:
# Checking Schema 

df_pyspark.printSchema()        # Pandas : df.info()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

#### Selecting Only Specific Columns

In [24]:
df_pandas[['Name','Sex']].head()

               Name   Sex
0  Oconnor, Frankie  male
1       Bryan, Drew  male
2    Owens, Kenneth  male
3     Kramer, James  male
4     Bond, Michael  male

In [25]:
df_pyspark.select(['Name','Sex']).show(5)  #To select only Name and Sex column

+----------------+----+
|            Name| Sex|
+----------------+----+
|Oconnor, Frankie|male|
|     Bryan, Drew|male|
|  Owens, Kenneth|male|
|   Kramer, James|male|
|   Bond, Michael|male|
+----------------+----+
only showing top 5 rows

#### Renaming column

In [27]:
df_pandas.rename(columns = {'Name':'Fullname'}, inplace = True)
df_pandas.head(2)

,PassengerId,Survived,Pclass,Fullname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S

In [28]:
df_pyspark=df_pyspark.withColumnRenamed('Name','FullName') # Pyspark dataframe do not have the inplace argument like pandas
df_pyspark.show(2)

+-----------+--------+------+----------------+----+----+-----+-----+------+-----+------+--------+
|PassengerId|Survived|Pclass|        FullName| Sex| Age|SibSp|Parch|Ticket| Fare| Cabin|Embarked|
+-----------+--------+------+----------------+----+----+-----+-----+------+-----+------+--------+
|          0|       1|     1|Oconnor, Frankie|male|null|    2|    0|209245|27.14|C12239|       S|
|          1|       0|     3|     Bryan, Drew|male|null|    0|    0| 27323|13.35|  null|       S|
+-----------+--------+------+----------------+----+----+-----+-----+------+-----+------+--------+
only showing top 2 rows

#### Adding new column

In [29]:
df_pandas['RoundedFare']=np.round(df_pandas.Fare)
df_pandas.head(3)

,PassengerId,Survived,Pclass,Fullname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,RoundedFare
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S,27.0
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S,13.0
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S,71.0

In [30]:
df_pyspark.withColumn("RoundedFare",round(df_pyspark['Fare'])).show(3)

+-----------+--------+------+----------------+----+----+-----+-----+---------+-----+------+--------+-----------+
|PassengerId|Survived|Pclass|        FullName| Sex| Age|SibSp|Parch|   Ticket| Fare| Cabin|Embarked|RoundedFare|
+-----------+--------+------+----------------+----+----+-----+-----+---------+-----+------+--------+-----------+
|          0|       1|     1|Oconnor, Frankie|male|null|    2|    0|   209245|27.14|C12239|       S|       27.0|
|          1|       0|     3|     Bryan, Drew|male|null|    0|    0|    27323|13.35|  null|       S|       13.0|
|          2|       0|     3|  Owens, Kenneth|male|0.33|    1|    2|CA 457703|71.29|  null|       S|       71.0|
+-----------+--------+------+----------------+----+----+-----+-----+---------+-----+------+--------+-----------+
only showing top 3 rows

#### Filters

In [31]:
df_pandas.loc[df_pandas['Pclass']==1].head()

,PassengerId,Survived,Pclass,Fullname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,RoundedFare
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S,27.0
8,8,0,1,"Wardlaw, Michael",male,27.0,2,1,474849,73.02,A7253,S,73.0
11,11,0,1,"Telschow, Robert",male,60.0,0,0,19600,31.50,A9055,S,32.0
14,14,1,1,"Seaton, Karen",female,44.0,0,1,12425,28.40,D6945,C,28.0
17,17,0,1,"Geiger, Maria",male,43.0,0,0,487299,29.84,NaN,S,30.0

In [32]:
# explain() : gives us the physical idea of how spark is going to transform the data and display it. Important for performance tuning & optimization
df_pyspark.filter("Pclass=1").explain()

== Physical Plan ==
*(1) Project [PassengerId#17, Survived#18, Pclass#19, Name#20 AS FullName#191, Sex#21, Age#22, SibSp#23, Parch#24, Ticket#25, Fare#26, Cabin#27, Embarked#28]
+- *(1) Filter (isnotnull(Pclass#19) AND (Pclass#19 = 1))
   +- FileScan csv [PassengerId#17,Survived#18,Pclass#19,Name#20,Sex#21,Age#22,SibSp#23,Parch#24,Ticket#25,Fare#26,Cabin#27,Embarked#28] Batched: false, DataFilters: [isnotnull(Pclass#19), (Pclass#19 = 1)], Format: CSV, Location: InMemoryFileIndex(1 paths)[file:/C:/Users/krish/OneDrive/Desktop/Study/Pyspark/data/Titanic.csv], PartitionFilters: [], PushedFilters: [IsNotNull(Pclass), EqualTo(Pclass,1)], ReadSchema: struct<PassengerId:int,Survived:int,Pclass:int,Name:string,Sex:string,Age:double,SibSp:int,Parch:...

In [33]:
df_pyspark.filter("Pclass==1").show(5)    # Using SQL Expression "Pclass == 1"

+-----------+--------+------+----------------+------+----+-----+-----+------+-----+------+--------+
|PassengerId|Survived|Pclass|        FullName|   Sex| Age|SibSp|Parch|Ticket| Fare| Cabin|Embarked|
+-----------+--------+------+----------------+------+----+-----+-----+------+-----+------+--------+
|          0|       1|     1|Oconnor, Frankie|  male|null|    2|    0|209245|27.14|C12239|       S|
|          8|       0|     1|Wardlaw, Michael|  male|27.0|    2|    1|474849|73.02| A7253|       S|
|         11|       0|     1|Telschow, Robert|  male|60.0|    0|    0| 19600| 31.5| A9055|       S|
|         14|       1|     1|   Seaton, Karen|female|44.0|    0|    1| 12425| 28.4| D6945|       C|
|         17|       0|     1|   Geiger, Maria|  male|43.0|    0|    0|487299|29.84|  null|       S|
+-----------+--------+------+----------------+------+----+-----+-----+------+-----+------+--------+
only showing top 5 rows

***Tip :*** use '&' for 'and', '|' for 'or', '~' for 'not' when building DataFrame boolean expressions

In [34]:
df_pandas.loc[(df_pandas['Pclass']==1) & (df_pandas['Embarked']=='S')][['Fullname','Pclass','Embarked']].head()

            Fullname  Pclass Embarked
0   Oconnor, Frankie       1        S
8   Wardlaw, Michael       1        S
11  Telschow, Robert       1        S
17     Geiger, Maria       1        S
21   Andrews, Tommie       1        S

In [35]:
df_pyspark.filter((df_pyspark['Pclass']==1) & (df_pyspark['Embarked']=="S")).select(['Fullname','Pclass','Embarked']).show(5)
# Alternative query : df_pyspark.filter("pclass==1 and Embarked like 'S'").select(['Fullname','Pclass','Embarked']).show(5)

+----------------+------+--------+
|        Fullname|Pclass|Embarked|
+----------------+------+--------+
|Oconnor, Frankie|     1|       S|
|Wardlaw, Michael|     1|       S|
|Telschow, Robert|     1|       S|
|   Geiger, Maria|     1|       S|
| Andrews, Tommie|     1|       S|
+----------------+------+--------+
only showing top 5 rows

In [36]:
#Example 3.0
df_pandas.loc[df_pandas.Age==df_pandas.Age.max()].Fullname

55085    Steelman, Rose
Name: Fullname, dtype: object

In [37]:
from pyspark.sql import functions as F
df_pyspark.filter(df_pyspark['Age']==df_pyspark.groupBy().agg(F.max("Age")).collect()[0][0]).select("Fullname").show()

+--------------+
|      Fullname|
+--------------+
|Steelman, Rose|
+--------------+

In [38]:
X="akdsj"
square = lambda x : x*x if(x > 0) else None
 
print(square(6))

36

In [39]:
#Example 4.0
df_pyspark.filter("Ticket like 'CA%'").show(2)
df_pyspark.where("Ticket like 'CA%'").show(2)

+-----------+--------+------+---------------+----+----+-----+-----+---------+-----+-----+--------+
|PassengerId|Survived|Pclass|       FullName| Sex| Age|SibSp|Parch|   Ticket| Fare|Cabin|Embarked|
+-----------+--------+------+---------------+----+----+-----+-----+---------+-----+-----+--------+
|          2|       0|     3| Owens, Kenneth|male|0.33|    1|    2|CA 457703|71.29| null|       S|
|         67|       0|     1|Stefani, Alfred|male|38.0|    1|    2| CA. 6654| 27.7|B4480|       S|
+-----------+--------+------+---------------+----+----+-----+-----+---------+-----+-----+--------+
only showing top 2 rows

+-----------+--------+------+---------------+----+----+-----+-----+---------+-----+-----+--------+
|PassengerId|Survived|Pclass|       FullName| Sex| Age|SibSp|Parch|   Ticket| Fare|Cabin|Embarked|
+-----------+--------+------+---------------+----+----+-----+-----+---------+-----+-----+--------+
|          2|       0|     3| Owens, Kenneth|male|0.33|    1|    2|CA 457703|71.29| null|       S|
|         67|       0|     1|Stefani, Alfred|male|38.0|    1|    2| CA. 6654| 27.7|B4480|       S|
+-----------+--------+------+---------------+----+----+-----+-----+---------+-----+-----+--------+
only showing top 2 rows

In [40]:
# df_pyspark.filter(col("Ticket").startswith("CA")).show(3)

#### Rounding off

In [41]:
from pyspark.sql.functions import format_number
from pyspark.sql.functions import stddev
Fare_std=df_pyspark.select(stddev('Fare').alias('stddev'))
Fare_std.show()
Fare_std.select(format_number('stddev',2)).alias('rounded_stddev').show()

+-----------------+
|           stddev|
+-----------------+
|69.58882046663861|
+-----------------+

+------------------------+
|format_number(stddev, 2)|
+------------------------+
|                   69.59|
+------------------------+

#### Aggregate

In [42]:
df_pandas.agg({'Fare':'max'})

Fare    744.66
dtype: float64

In [43]:
df_pyspark.agg({'Fare':'avg'}).show()

+-----------------+
|        avg(Fare)|
+-----------------+
|43.92933040273972|
+-----------------+

In [44]:
df_pandas.agg({'Fare':['mean','max','min']}).T

          mean     max   min
Fare  43.92933  744.66  0.68

In [45]:
from pyspark.sql import functions as F
df_pyspark.groupBy().agg(F.mean('Fare').alias('Mean'),F.max('Fare').alias('Max'), F.min('Fare').alias('Min')).show()

# Note :
# df_pyspark.agg({'Fare':['avg','max','min']}).show() : Syntactically not supported in spark 
# df_pyspark.agg({'Fare':'avg','Fare':'max','Fare':'min'}).show() : Prints only min Fare due to method overriding

+-----------------+------+----+
|             Mean|   Max| Min|
+-----------------+------+----+
|43.92933040273972|744.66|0.68|
+-----------------+------+----+

In [46]:
# Average Fare 
print("Average Fare in Pandas DataFrame: ", df_pandas.Fare.mean())
print("Average Fare in Pyspark DataFrame: ", df_pyspark.groupBy().avg().collect()[0][6])

Average Fare in Pandas DataFrame:  43.92933040273962
Average Fare in Pyspark DataFrame:  43.92933040273972

In [47]:
# Max Fare 
print("Max Fare in Pandas DataFrame: ", df_pandas.Fare.max())
print("Max Fare in Pyspark DataFrame: ", df_pyspark.groupBy().max().collect()[0][6])

Max Fare in Pandas DataFrame:  744.66
Max Fare in Pyspark DataFrame:  744.66

In [48]:
# Min Fare 
print("Min Fare in Pandas DataFrame: ", df_pandas.Fare.min())
print("Min Fare in Pyspark DataFrame: ", df_pyspark.groupBy().min().collect()[0][6])

Min Fare in Pandas DataFrame:  0.68
Min Fare in Pyspark DataFrame:  0.68

#### groupby & aggregate

In [49]:
df_pandas.groupby('Sex').mean().Age

Sex
female    40.044890
male      37.030884
Name: Age, dtype: float64

In [50]:
df_pyspark.groupby('Sex').avg('Age').show()

+------+-----------------+
|   Sex|         avg(Age)|
+------+-----------------+
|female|40.04489023787676|
|  male|37.03088383419117|
+------+-----------------+

#### Crosstab

In [51]:
pd.crosstab(index=df_pandas.Sex,columns="Survived")

col_0   Survived
Sex
female     43886
male       56114

In [52]:
df_pyspark.crosstab('Sex','Survived').show()

+------------+-----+-----+
|Sex_Survived|    0|    1|
+------------+-----+-----+
|        male|44566|11548|
|      female|12660|31226|
+------------+-----+-----+

#### Checking Null Values

In [53]:
# Checking number of Nullvalues in Age column
df_pandas['Age'].isnull().sum()

3292

In [54]:
#Using Pyspark SQL statements 
print(df_pyspark.filter("Age is  null").count())                # Alternative : df_pyspark.where("Age is null").count()

# Checking using column
print(df_pyspark.filter(df_pyspark['Age'].isNull()).count())    # Alternative : df.where(df.Value.isNotNull()).show()

3292
3292

In [55]:
df_pandas.isnull().sum()

PassengerId        0
Survived           0
Pclass             0
Fullname           0
Sex                0
Age             3292
SibSp              0
Parch              0
Ticket          4623
Fare             134
Cabin          67866
Embarked         250
RoundedFare      134
dtype: int64

In [56]:
# Pyspark 'DataFrame' object has no attribute 'isNull'
for i in df_pyspark.columns:
    print("Null values in '{}' column = {}".format(i,df_pyspark.filter(df_pyspark[i].isNull()).count()) )

Null values in 'PassengerId' column = 0
Null values in 'Survived' column = 0
Null values in 'Pclass' column = 0
Null values in 'FullName' column = 0
Null values in 'Sex' column = 0
Null values in 'Age' column = 3292
Null values in 'SibSp' column = 0
Null values in 'Parch' column = 0
Null values in 'Ticket' column = 4623
Null values in 'Fare' column = 134
Null values in 'Cabin' column = 67866
Null values in 'Embarked' column = 250

#### Dropping/Filling missing values

In [ ]:
## Drop any row containing atleast 1 missing value 

# df_pandas.dropna(axis=0,inplace=True)
# df_pyspark.na.drop().show()

In [ ]:
## Drop any row containing atleast 2 missing value 

# df_pandas.dropna(axis=0,thresh=2,inplace=True)
# df_pyspark.na.drop(thresh=2).show()

In [ ]:
## Filling every missing value in the dataframe with "New Value"
# df_pandas.fillna("New Value",inplace=True)
# df_pyspark.na.fill('NEW VALUE').show()

Here spark will only impute the string dtypes with "New Value" and remaining null value of other datatypes will still be NaN as the dtype of imputation does not match.But here pandas does not care if the datatype used for the imputation matches with the datatypes of the column or not.

In [ ]:
## Filling null values in a specific column

# df_pandas.Age.fillna(0)                        # Returns only the Age series
# df_pyspark.na.fill(0,subset=['Age']).show()    # Returns the whole dataframe

In [ ]:
## Imputing missing values with mean of the data

# df_pandas.Fare.fillna(df.Fare.mean())

# from pyspark.sql.functions import mean
# mean_val=df_pyspark.select(mean(df_pyspark['Fare'])).collect()[0][0]
# df_pyspark.na.fill(mean_val,["Fare"]).show()

#### Checking Unique/Distinct Values for columns

In [57]:
print("Number of Unique values for Sex column : ",df_pandas['Sex'].nunique())
print(type(df_pandas['Sex'].unique()))
df_pandas['Sex'].unique()

Number of Unique values for Sex column :  2
<class 'numpy.ndarray'>

array(['male', 'female'], dtype=object)

In [58]:
print("Number of Unique values for Sex column : ",df_pyspark.select('Sex').distinct().count())
print(type(df_pyspark.select('Sex').distinct().dtypes))
df_pyspark.select('Sex').distinct().show()

Number of Unique values for Sex column :  2
<class 'list'>
+------+
|   Sex|
+------+
|female|
|  male|
+------+

In [59]:
## Alternate query : Using pyspark.sql.functions
from pyspark.sql.functions import countDistinct
df_pyspark.select(countDistinct("Sex").alias("unique_genders")).show()
print(type(df_pyspark.select(countDistinct("Sex"))))

+--------------+
|unique_genders|
+--------------+
|             2|
+--------------+

<class 'pyspark.sql.dataframe.DataFrame'>

#### value_count() operation

In [60]:
df_pandas['Pclass'].value_counts()

3    41006
1    30315
2    28679
Name: Pclass, dtype: int64

In [61]:
# Like in pandas value_counts function is not available so we need to grouby and aggregate to have the same operation
df_pyspark.groupby('Pclass').count().orderBy(col('Pclass').desc()).show()

+------+-----+
|Pclass|count|
+------+-----+
|     3|41006|
|     2|28679|
|     1|30315|
+------+-----+

#### Sorting

In [62]:
df_pandas.sort_values(by=['Age'],ascending=False).head(3)

,PassengerId,Survived,Pclass,Fullname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,RoundedFare
55085,55085,1,2,"Steelman, Rose",female,87.0,0,2,27657,35.80,NaN,C,36.0
61780,61780,1,2,"Williams, Chelsea",female,86.0,0,0,14693,37.59,NaN,C,38.0
66300,66300,1,2,"Fulmer, Jean",female,86.0,0,0,424031,7.05,NaN,C,7.0

In [63]:
df_pyspark.orderBy(df_pyspark['Age'].desc()).show(3)

# Alternative Query : df_pyspark.sort(col('Age'),ascending=False).show(3)

+-----------+--------+------+-----------------+------+----+-----+-----+------+-----+-----+--------+
|PassengerId|Survived|Pclass|         FullName|   Sex| Age|SibSp|Parch|Ticket| Fare|Cabin|Embarked|
+-----------+--------+------+-----------------+------+----+-----+-----+------+-----+-----+--------+
|      55085|       1|     2|   Steelman, Rose|female|87.0|    0|    2| 27657| 35.8| null|       C|
|      66300|       1|     2|     Fulmer, Jean|female|86.0|    0|    0|424031| 7.05| null|       C|
|      61780|       1|     2|Williams, Chelsea|female|86.0|    0|    0| 14693|37.59| null|       C|
+-----------+--------+------+-----------------+------+----+-----+-----+------+-----+-----+--------+
only showing top 3 rows

#### map function

Replace the Bad characters(Characters apart from Numerice Characters)

In [69]:
df_pandas.Ticket=df_pandas.Ticket.map(lambda S: str(S).strip("CA ").strip("/S").strip("PC").strip("."))
df_pandas.head(5)

,PassengerId,Survived,Pclass,Fullname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,RoundedFare
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S,27.0
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S,13.0
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,457703,71.29,NaN,S,71.0
3,3,0,3,"Kramer, James",male,19.00,0,0,10866,13.04,NaN,S,13.0
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S,8.0

In [70]:
df_pyspark=df_pyspark.withColumn("Ticket",F.regexp_replace("Ticket","[CA]|[A]|[P]|/S|/",""))
df_pyspark.show(5)

+-----------+--------+------+----------------+----+----+-----+-----+-------+-----+------+--------+
|PassengerId|Survived|Pclass|        FullName| Sex| Age|SibSp|Parch| Ticket| Fare| Cabin|Embarked|
+-----------+--------+------+----------------+----+----+-----+-----+-------+-----+------+--------+
|          0|       1|     1|Oconnor, Frankie|male|null|    2|    0| 209245|27.14|C12239|       S|
|          1|       0|     3|     Bryan, Drew|male|null|    0|    0|  27323|13.35|  null|       S|
|          2|       0|     3|  Owens, Kenneth|male|0.33|    1|    2| 457703|71.29|  null|       S|
|          3|       0|     3|   Kramer, James|male|19.0|    0|    0|. 10866|13.04|  null|       S|
|          4|       1|     3|   Bond, Michael|male|25.0|    0|    0| 427635| 7.76|  null|       S|
+-----------+--------+------+----------------+----+----+-----+-----+-------+-----+------+--------+
only showing top 5 rows

Replace Male with 0 and Female with 1

In [71]:
df_pandas.Sex=df_pandas.Sex.map({"male":0,"female":1})
df_pandas.head(5)

,PassengerId,Survived,Pclass,Fullname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,RoundedFare
0,0,1,1,"Oconnor, Frankie",0,NaN,2,0,209245,27.14,C12239,S,27.0
1,1,0,3,"Bryan, Drew",0,NaN,0,0,27323,13.35,NaN,S,13.0
2,2,0,3,"Owens, Kenneth",0,0.33,1,2,457703,71.29,NaN,S,71.0
3,3,0,3,"Kramer, James",0,19.00,0,0,10866,13.04,NaN,S,13.0
4,4,1,3,"Bond, Michael",0,25.00,0,0,427635,7.76,NaN,S,8.0

In [72]:
df_pyspark=df_pyspark.withColumn("Sex",F.regexp_replace("Sex","female","1"))
df_pyspark=df_pyspark.withColumn("Sex",F.regexp_replace("Sex","male","0"))
df_pyspark.show(5)

+-----------+--------+------+----------------+---+----+-----+-----+-------+-----+------+--------+
|PassengerId|Survived|Pclass|        FullName|Sex| Age|SibSp|Parch| Ticket| Fare| Cabin|Embarked|
+-----------+--------+------+----------------+---+----+-----+-----+-------+-----+------+--------+
|          0|       1|     1|Oconnor, Frankie|  0|null|    2|    0| 209245|27.14|C12239|       S|
|          1|       0|     3|     Bryan, Drew|  0|null|    0|    0|  27323|13.35|  null|       S|
|          2|       0|     3|  Owens, Kenneth|  0|0.33|    1|    2| 457703|71.29|  null|       S|
|          3|       0|     3|   Kramer, James|  0|19.0|    0|    0|. 10866|13.04|  null|       S|
|          4|       1|     3|   Bond, Michael|  0|25.0|    0|    0| 427635| 7.76|  null|       S|
+-----------+--------+------+----------------+---+----+-----+-----+-------+-----+------+--------+
only showing top 5 rows

#### Statistical Describe/Summary

In [73]:
# df_pandas.describe()
df_pandas[['Pclass','Survived']].describe()

              Pclass       Survived
count  100000.000000  100000.000000
mean        2.106910       0.427740
std         0.837727       0.494753
min         1.000000       0.000000
25%         1.000000       0.000000
50%         2.000000       0.000000
75%         3.000000       1.000000
max         3.000000       1.000000

In [75]:
df_pyspark.select('Pclass','Survived').summary().show()
# Close alternate query : df_pyspark.describe(['Pclass','Survived']).show()
# For the whole dataframe : df_pyspark.summary().show()

+-------+------------------+-------------------+
|summary|            Pclass|           Survived|
+-------+------------------+-------------------+
|  count|            100000|             100000|
|   mean|           2.10691|            0.42774|
| stddev|0.8377274436072256|0.49475341353991886|
|    min|                 1|                  0|
|    25%|                 1|                  0|
|    50%|                 2|                  0|
|    75%|                 3|                  1|
|    max|                 3|                  1|
+-------+------------------+-------------------+

In [76]:
quantiles=[0.25,0.50,0.75,0.90]

In [77]:
df_pandas[['Pclass','Survived']].describe(percentiles=quantiles).T

             count     mean       std  min  25%  50%  75%  90%  max
Pclass    100000.0  2.10691  0.837727  1.0  1.0  2.0  3.0  3.0  3.0
Survived  100000.0  0.42774  0.494753  0.0  0.0  0.0  1.0  1.0  1.0

In [80]:
# As spark is a distributed system so we do not get quantiles but approxQuantile
df_pyspark.approxQuantile(['Pclass','Survived'],quantiles,0.05) # 0.05=Error Tolerance

[[1.0, 2.0, 3.0, 3.0], [0.0, 0.0, 1.0, 1.0]]

#### Values/Collect

In [81]:
df_pandas.values[:3]                            # Represents the row values in the form of an array of numpy.ndarray

array([['0', 1, 1, 'Oconnor, Frankie', 0, nan, 2, 0, '209245', 27.14,
        'C12239', 'S', 27.0],
       ['1', 0, 3, 'Bryan, Drew', 0, nan, 0, 0, '27323', 13.35, nan, 'S',
        13.0],
       ['2', 0, 3, 'Owens, Kenneth', 0, 0.33, 1, 2, '457703', 71.29, nan,
        'S', 71.0]], dtype=object)

In [82]:
print(type(df_pandas.values[0]))

<class 'numpy.ndarray'>

In [83]:
df_pyspark.collect()[:3]                       # Represents the row values in the form of a list of sql rows types

[Row(PassengerId=0, Survived=1, Pclass=1, FullName='Oconnor, Frankie', Sex='0', Age=None, SibSp=2, Parch=0, Ticket='209245', Fare=27.14, Cabin='C12239', Embarked='S'),
 Row(PassengerId=1, Survived=0, Pclass=3, FullName='Bryan, Drew', Sex='0', Age=None, SibSp=0, Parch=0, Ticket='27323', Fare=13.35, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=0, Pclass=3, FullName='Owens, Kenneth', Sex='0', Age=0.33, SibSp=1, Parch=2, Ticket=' 457703', Fare=71.29, Cabin=None, Embarked='S')]

In [84]:
type(df_pyspark.collect()[0])

pyspark.sql.types.Row

#### Row->Dictionary

In [85]:
df_pandas.loc[0].to_dict()

{'PassengerId': '0',
 'Survived': 1,
 'Pclass': 1,
 'Fullname': 'Oconnor, Frankie',
 'Sex': 0,
 'Age': nan,
 'SibSp': 2,
 'Parch': 0,
 'Ticket': '209245',
 'Fare': 27.14,
 'Cabin': 'C12239',
 'Embarked': 'S',
 'RoundedFare': 27.0}

In [86]:
df_pyspark.collect()[0].asDict()

{'PassengerId': 0,
 'Survived': 1,
 'Pclass': 1,
 'FullName': 'Oconnor, Frankie',
 'Sex': '0',
 'Age': None,
 'SibSp': 2,
 'Parch': 0,
 'Ticket': '209245',
 'Fare': 27.14,
 'Cabin': 'C12239',
 'Embarked': 'S'}